namespace EmpireCraft.Scripts.Regimes.TemporaryFactions;

public enum TemporaryFactionType
{
    转军府, //当地方省份位于边疆或者周边有任一军府时，且对帝国忠诚度低，会自行发起转军府决议
    扩张地盘, //当地方军府领导控制力大于当前地盘且对帝国忠诚度低时可发起扩张
    独立,
    提供岁币,
    割让城池,
    转世袭,
    索取皇位,
    开科取士,
    削藩,
    拓展金融霸权,
    缩减金融霸权,
    输出革命,
    扶持革命党,
    夺取诸侯开战权,
    转天朝制度,
    转周制,
    加强神权,
    允许诸侯自由开战,
    分封,
    强者继承法,
    地方官叛乱,
    撤销军府,
    降低赋税,
    提高赋税,
    提高福利,
    自由信仰,
    渴望共和,
    清除移民,
    复辟帝制,
    宗教同化,
    农民起义,
    支持皇子,
    对外扩张,
    汉化,
    收回地盘,
    开放移民,
    谋求统一,
    无
}